In [57]:
import sqlalchemy as db
import pandas as pd
import numpy as np


path = "/home/radwa/Radwa.Usecase/Landing/orders/orders.csv"

df_order = pd.read_csv(path)

In [66]:
df_order.isnull().sum()

order_id         0
customer_id      0
order_status     0
order_date       0
required_date    0
shipped_date     0
store_id         0
staff_id         0
Extract_time     0
Source           0
dtype: int64

In [67]:
df_order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6460 entries, 0 to 6459
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       6460 non-null   int64
 1   customer_id    6460 non-null   int64
 2   order_status   6460 non-null   int64
 3   order_date     6460 non-null   datetime64[ns]
 4   required_date  6460 non-null   datetime64[ns]
 5   shipped_date   6460 non-null   datetime64[ns]
 6   store_id       6460 non-null   int64
 7   staff_id       6460 non-null   int64
 8   Extract_time   6460 non-null   object
 9   Source         6460 non-null   object
dtypes: datetime64[ns](3), int64(5), object(2)
memory usage: 504.8+ KB

In [60]:
df_order["order_date"] = pd.to_datetime(df_order["order_date"], errors='coerce')

In [61]:
df_order["required_date"] = pd.to_datetime(df_order["required_date"], errors='coerce')

In [62]:
df_order["shipped_date"] = pd.to_datetime(df_order["shipped_date"], errors='coerce')

In [63]:
order_date_mean = df_order['order_date']

date_mean = order_date_mean.mean()

df_order['order_date'].fillna(date_mean, inplace=True)

In [64]:

df_order['shipped_date'].fillna(method = 'ffill', inplace=True)

In [65]:
df_order['required_date'].fillna(method = 'ffill', inplace=True)

In [68]:
df_order

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id,Extract_time,Source
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2,2024-05-02 11:54:57.869750,postgres
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6,2024-05-02 11:54:57.869750,postgres
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7,2024-05-02 11:54:57.869750,postgres
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3,2024-05-02 11:54:57.869750,postgres
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6,2024-05-02 11:54:57.869750,postgres
...,...,...,...,...,...,...,...,...,...,...
6455,1611,6,3,2018-09-06,2018-09-06,2018-04-02,2,7,2024-05-02 11:54:57.869750,postgres
6456,1612,3,3,2018-10-21,2018-10-21,2018-04-02,1,3,2024-05-02 11:54:57.869750,postgres
6457,1613,1,3,2018-11-18,2018-11-18,2018-04-02,2,6,2024-05-02 11:54:57.869750,postgres
6458,1614,135,3,2018-11-28,2018-11-28,2018-04-02,3,8,2024-05-02 11:54:57.869750,postgres
6459,1615,136,3,2018-12-28,2018-12-28,2018-04-02,3,8,2024-05-02 11:54:57.869750,postgres

In [69]:
duplicate_ids = df_order['order_id'].duplicated() 

df_duplicate_ids = df_order[duplicate_ids]

print("Rows with duplicate 'id':")
print(df_duplicate_ids)

Rows with duplicate 'id':
      order_id  customer_id  order_status order_date required_date  \
1615         1          259             4 2016-01-01    2016-01-03
1616         2         1212             4 2016-01-01    2016-01-04
1617         3          523             4 2016-01-02    2016-01-05
1618         4          175             4 2016-01-03    2016-01-04
1619         5         1324             4 2016-01-03    2016-01-06
...        ...          ...           ...        ...           ...
6455      1611            6             3 2018-09-06    2018-09-06
6456      1612            3             3 2018-10-21    2018-10-21
6457      1613            1             3 2018-11-18    2018-11-18
6458      1614          135             3 2018-11-28    2018-11-28
6459      1615          136             3 2018-12-28    2018-12-28

     shipped_date  store_id  staff_id                Extract_time    Source
1615   2016-01-03         1         2  2024-05-02 11:54:57.869750  postgres
1616   2016-01-03         2         6  2024-05-02 11:54:57.869750  postgres
1617   2016-01-03         2         7  2024-05-02 11:54:57.869750  postgres
1618   2016-01-05         1         3  2024-05-02 11:54:57.869750  postgres
1619   2016-01-06         2         6  2024-05-02 11:54:57.869750  postgres
...           ...       ...       ...                         ...       ...
6455   2018-04-02         2         7  2024-05-02 11:54:57.869750  postgres
6456   2018-04-02         1         3  2024-05-02 11:54:57.869750  postgres
6457   2018-04-02         2         6  2024-05-02 11:54:57.869750  postgres
6458   2018-04-02         3         8  2024-05-02 11:54:57.869750  postgres
6459   2018-04-02         3         8  2024-05-02 11:54:57.869750  postgres

[4845 rows x 10 columns]

In [70]:
duplicate_rows = df_order.duplicated()  

df_duplicates = df_order[duplicate_rows]

print("Duplicate rows:")
print(df_duplicates)

Duplicate rows:
      order_id  customer_id  order_status order_date required_date  \
1615         1          259             4 2016-01-01    2016-01-03
1616         2         1212             4 2016-01-01    2016-01-04
1617         3          523             4 2016-01-02    2016-01-05
1618         4          175             4 2016-01-03    2016-01-04
1619         5         1324             4 2016-01-03    2016-01-06
...        ...          ...           ...        ...           ...
6455      1611            6             3 2018-09-06    2018-09-06
6456      1612            3             3 2018-10-21    2018-10-21
6457      1613            1             3 2018-11-18    2018-11-18
6458      1614          135             3 2018-11-28    2018-11-28
6459      1615          136             3 2018-12-28    2018-12-28

     shipped_date  store_id  staff_id                Extract_time    Source
1615   2016-01-03         1         2  2024-05-02 11:54:57.869750  postgres
1616   2016-01-03         2         6  2024-05-02 11:54:57.869750  postgres
1617   2016-01-03         2         7  2024-05-02 11:54:57.869750  postgres
1618   2016-01-05         1         3  2024-05-02 11:54:57.869750  postgres
1619   2016-01-06         2         6  2024-05-02 11:54:57.869750  postgres
...           ...       ...       ...                         ...       ...
6455   2018-04-02         2         7  2024-05-02 11:54:57.869750  postgres
6456   2018-04-02         1         3  2024-05-02 11:54:57.869750  postgres
6457   2018-04-02         2         6  2024-05-02 11:54:57.869750  postgres
6458   2018-04-02         3         8  2024-05-02 11:54:57.869750  postgres
6459   2018-04-02         3         8  2024-05-02 11:54:57.869750  postgres

[4817 rows x 10 columns]

In [71]:
df_order['order_id'].drop_duplicates(inplace=True, keep="first")

In [72]:
start_date = pd.to_datetime("2000-01-01") 
end_date = pd.to_datetime("2024-12-31")  

is_within_range = df_order["order_date"].between(start_date, end_date)

df_order_table = df_order[is_within_range]

In [73]:
import os

csv_path = "/home/radwa/Radwa.Usecase/staging_1/orders/orders.csv" 

directory = os.path.dirname(csv_path)
if not os.path.exists(directory):
    os.makedirs(directory)
    
df_order_table.to_csv(csv_path, index=False)